Revit 2024 API
TriangulationInterface Class
 This abstract class provides an interface for querying a triangulation structure (vertices and triangles).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class TriangulationInterface : IDisposable
Visual Basic
Public Class TriangulationInterface _
	Implements IDisposable
Visual C++
public ref class TriangulationInterface : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TriangulationInterface
 Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
 Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell
See Also
TriangulationInterface Members
Autodesk.Revit.DB Namespace